**`teams/hmpps/windows_server_2022`** terragrunt plan on `pull_request` event [#162](${url})

```
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 2s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/hmpps-windows-server-2022"
        name         = "hmpps_windows_server_2022"
      ~ tags         = {
            "amazon-cloudwatch-agent-windows-version" = "1.0.0"
            "application"                             = "NOMIS"
            "branch"                                  = "main"
            "business-unit"                           = "HMPPS"
            "ec2launch-v2-windows-version"            = "1.0.0"
            "image-pipeline"                          = "hmpps_windows_server_2022"
          ~ "image-recipe"                            = "hmpps_windows_server_2022/0.2.0" -> "hmpps_windows_server_2022/0.2.1"
          ~ "infrastructure-configuration"            = "hmpps_windows_server_2022/0.2.0" -> "hmpps_windows_server_2022/0.2.1"
            "is-production"                           = "true"
            "os-version"                              = "windows server 2022"
            "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
            "release-or-patch"                        = "release"
            "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      ~ tags_all     = {
          ~ "image-recipe"                            = "hmpps_windows_server_2022/0.2.0" -> "hmpps_windows_server_2022/0.2.1"
          ~ "infrastructure-configuration"            = "hmpps_windows_server_2022/0.2.0" -> "hmpps_windows_server_2022/0.2.1"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      - distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this will be created
  + resource "aws_imagebuilder_image_pipeline" "this" {
      + arn                              = (known after apply)
      + date_created                     = (known after apply)
      + date_last_run                    = (known after apply)
      + date_next_run                    = (known after apply)
      + date_updated                     = (known after apply)
      + description                      = "windows server 2022"
      + distribution_configuration_arn   = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/hmpps-windows-server-2022"
      + enhanced_image_metadata_enabled  = true
      + id                               = (known after apply)
      + image_recipe_arn                 = (known after apply)
      + infrastructure_configuration_arn = (known after apply)
      + name                             = "hmpps_windows_server_2022"
      + platform                         = (known after apply)
      + status                           = "ENABLED"
      + tags                             = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "hmpps_windows_server_2022"
          + "image-recipe"                            = "hmpps_windows_server_2022/0.2.1"
          + "infrastructure-configuration"            = "hmpps_windows_server_2022/0.2.1"
          + "is-production"                           = "true"
          + "os-version"                              = "windows server 2022"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      + tags_all                         = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "hmpps_windows_server_2022"
          + "image-recipe"                            = "hmpps_windows_server_2022/0.2.1"
          + "infrastructure-configuration"            = "hmpps_windows_server_2022/0.2.1"
          + "is-production"                           = "true"
          + "os-version"                              = "windows server 2022"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }

      + image_tests_configuration {
          + image_tests_enabled = false
          + timeout_minutes     = 720
        }

      + schedule {
          + pipeline_execution_start_condition = "EXPRESSION_MATCH_ONLY"
          + schedule_expression                = "cron(0 0 2 * ? *)"
          + timezone                           = (known after apply)
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/hmpps-windows-server-2022/0.1.8" -> (known after apply)
      ~ date_created     = "2024-01-29T14:19:44.044Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/hmpps-windows-server-2022/0.1.8" -> (known after apply)
        name             = "hmpps_windows_server_2022"
      ~ owner            = "374269020027" -> (known after apply)
      ~ platform         = "Windows" -> (known after apply)
      ~ tags             = {
            "amazon-cloudwatch-agent-windows-version" = "1.0.0"
            "application"                             = "NOMIS"
            "branch"                                  = "main"
            "business-unit"                           = "HMPPS"
            "ec2launch-v2-windows-version"            = "1.0.0"
            "image-pipeline"                          = "hmpps_windows_server_2022"
          ~ "image-recipe"                            = "hmpps_windows_server_2022/0.1.8" -> "hmpps_windows_server_2022/0.2.1"
          ~ "infrastructure-configuration"            = "hmpps_windows_server_2022/0.1.8" -> "hmpps_windows_server_2022/0.2.1"
            "is-production"                           = "true"
            "os-version"                              = "windows server 2022"
            "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
            "release-or-patch"                        = "release"
            "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      ~ tags_all         = {
          ~ "image-recipe"                            = "hmpps_windows_server_2022/0.1.8" -> "hmpps_windows_server_2022/0.2.1"
          ~ "infrastructure-configuration"            = "hmpps_windows_server_2022/0.1.8" -> "hmpps_windows_server_2022/0.2.1"
            # (11 unchanged elements hidden)
        }
      + user_data_base64 = (known after apply)
      ~ version          = "0.1.8" -> "0.2.1" # forces replacement
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

      ~ component { # forces replacement
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/powershell-core/0.4.0" -> "arn:aws:imagebuilder:eu-west-2:374269020027:component/powershell-core/1.0.0" # forces replacement
        }
      + component { # forces replacement
          + component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/git-windows/0.0.2" # forces replacement
        }

        # (4 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/hmpps-windows-server-2022-0-2-0" -> (known after apply)
      ~ date_created                  = "2024-02-12T10:04:50.114Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/hmpps-windows-server-2022-0-2-0" -> (known after apply)
      ~ name                          = "hmpps_windows_server_2022_0_2_0" -> "hmpps_windows_server_2022_0_2_1" # forces replacement
      ~ resource_tags                 = {
          ~ "image-recipe"                            = "hmpps_windows_server_2022/0.2.0" -> "hmpps_windows_server_2022/0.2.1"
          ~ "infrastructure-configuration"            = "hmpps_windows_server_2022/0.2.0" -> "hmpps_windows_server_2022/0.2.1"
            # (11 unchanged elements hidden)
        }
      ~ tags                          = {
            "amazon-cloudwatch-agent-windows-version" = "1.0.0"
            "application"                             = "NOMIS"
            "branch"                                  = "main"
            "business-unit"                           = "HMPPS"
            "ec2launch-v2-windows-version"            = "1.0.0"
            "image-pipeline"                          = "hmpps_windows_server_2022"
          ~ "image-recipe"                            = "hmpps_windows_server_2022/0.2.0" -> "hmpps_windows_server_2022/0.2.1"
          ~ "infrastructure-configuration"            = "hmpps_windows_server_2022/0.2.0" -> "hmpps_windows_server_2022/0.2.1"
            "is-production"                           = "true"
            "os-version"                              = "windows server 2022"
            "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
            "release-or-patch"                        = "release"
            "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      ~ tags_all                      = {
          ~ "image-recipe"                            = "hmpps_windows_server_2022/0.2.0" -> "hmpps_windows_server_2022/0.2.1"
          ~ "infrastructure-configuration"            = "hmpps_windows_server_2022/0.2.0" -> "hmpps_windows_server_2022/0.2.1"
            # (11 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 2 to destroy.

```
